/*:
 ## 懐かしい日々
 
 このPlaygroundでは、1970年代以降の新しいプログラマが続けてきた習慣を体験します。その前に、少し知っておく必要があります。Xcodeのプログラミング環境を構成する方法から始めましょう。
*/
/*:
 これまでプロジェクトにいくつか取り組んできましたが、皆さんのコードが、多くの人がイメージするコードと少し外観が異なることに気づいたかもしれません。皆さんがPlaygroundで目にするコードは、こちらです。
 */
/*:
 ![白の背景に複数色のテキストが表示されたコードサンプル](NowTimeyCode.png)
 */
/*:
 そして、（古い）映画に出てくるプログラマの画面に表示されているのは、このようなコードです。
 */
/*: 
 ![黒の背景に緑色のテキストが表示されたコードサンプル](OldTimeyCode.png)
 */
/*: 
 これらのコードサンプルは、まったく同じものです。同じように動作し、同じ結果が得られます。では、黒地に緑のスタイルはどうなってしまったのでしょうか？
 */
/*: 
 話は、1970年代、1980年代にさかのぼります。コンピュータのディスプレイが白黒で、単色しか表示できなかったため、黒の画面に緑色のテキストを表示するのが普通でした。
 */
/*: 
 今でも、目に優しい（特に暗い部屋で仕事をする場合）という理由、またはレトロな感じが好きだという理由で黒の背景を選ぶプログラマもいます。
 */
/*: 
 皆さんは、良いコードを記述できるのであれば、どのような配色を使ってもかまいません。次のページの手順に従って、Xcodeの配色を変えてみましょう。
 */
/*: 
1／11ページ  |  [次は「色を変更する」です。](@next)
*/
