/*:
 ## まとめ
 
 配列を使ってアイテムのリストを保持できます。配列には主に2つの特徴があります。
 
 - 配列内のアイテムはすべて同じ型です。
 
 
 - 配列内の型には特定の順番があります。
*/
/*:
 この2つの特徴があることによって、インデックスを使って配列内の特定の場所にあるアイテムにアクセスしたり、常に特定の型の値を取得できます。
 */
/*:
 そのほか、配列について以下のことを学習しました。

 - 配列の最初のインデックスは1ではなくゼロです。
 
 
 - インデックスを使って配列にアクセスするのは危険な場合があります。インデックスが配列の境界の外で使用されている場合、プログラムがクラッシュします。
 
 
 - 配列内のアイテム数を調べるには、`count`プロパティを使います。
 
 
 - `for…in`ループを使うと、配列内の各アイテムに安全に順番にアクセスできます。配列にアイテムがいくつ含まれるか知っておく必要はありません。

 
 - 可変配列では、アイテムを追加、削除、置換できます。
 */
/*:
 演習問題で、学んだことを練習しましょう。
 */
/*:
[前ヘ](@previous)  |  12／17ページ  |  [次は「演習：Count」です。](@next)
*/
