/*:
 ## 演習問題：よい名前
 
 あなたは、「Swiftによるアプリケーション開発：入門編」コースを受講したことのない別のプログラマからコードを引き継ぎました。あなたが受け取ったメモには、次のように書かれていました。
 
 > (メモ):  **トラックの荷積みガイド**
>
 > オレンジのパレットの重量は100ポンド
>
 > スイカのパレットの重量は200ポンド
>
 > トラックの左側に積み込んでから右側に積み込み、バランスを維持する必要があります。左右にそれぞれいくつ積み込みますか？果物は常に2種類あります。
*/
let co = 14
let cw = 3
let ow = 100
let ww = 200
let to = co * ow
let tw = cw * ww
let ttl = to + tw
let es = ttl / 2
let lhso = es / ow
let rhso = co - lhso


//: - experiment:(実験): メモがなくてもわかるようにコードを書き換えてください。意味のある名前とコメントを使ってください。






/*:
 _Copyright (C) 2017 Apple Inc. All Rights Reserved._\
 _このサンプルのライセンス情報については、LICENSE.txtを参照してください。_
*/
//:[前ヘ](@previous)  |  14／14ページ
