/*:
 ## 演習問題：アイデンティティ
 
 インスタンスの値が独自のアイデンティティを持つとは、どのような意味でしょうか？
 */
/*:
 - callout(演習):
 変数`myPlans`を作成し、初期値はあなたの夜の予定を説明する文字列にします。\
2つ目の変数`friendPlans`を作成し、初期値を`myPlans`にします。（予定を決めるのは、友達ではなく主にあなたです。）\
`friendPlans`の宣言の下で加算演算子`+`を使ってもう1つ活動を追加し、`myPlans`をアップデートしてください。\
`myPlans`と`friendPlans`の値を確認します。同じですか？それとも、違いますか？
*/
// ここで変数を作成してください。



// ここで`myPlans`をアップデートしてください。




/*:
 - callout(演習):
 文字列を取る関数`addDance`を作成し、ダンスに関するフレーズ（`"and then we dance!"`や`"but no dancing"`など、好きなもの）を追加して新しい文字列を返します。\
`myPlans`で`addDance`関数を呼び出し、結果を`friendPlans`に代入します。
*/
// ここで関数を定義して呼び出してください。




/*:
 - callout(演習):
 `friendPlans`はどのように変わると思いますか？`myPlans`はどのように変わると思いますか？\
 両方のインスタンスを出力して調べましょう。
*/
// ここで出力し、予想どおりかどうかチェックしてください。




/*:
 _Copyright (C) 2017 Apple Inc. All Rights Reserved._\
 _このサンプルのライセンス情報については、LICENSE.txtを参照してください。_
 */
/*:
[前ヘ](@previous)  |  17／17ページ
*/
