/*:
 ## 演習問題：値の表示
 
 以前、iPhoneの空きスペースの計算に関するPlaygroundの演習問題に取り組みました。以下の情報を確認しましたね。
 */
/*:    
    
 - iPhoneの容量はギガバイト（GB）で計測します。問題で使用されるiPhoneのストレージは8GBです。
     
     
 - 1GBは1,000メガバイト（MB）です。
 
 
 - このiPhoneでは、すでに3GBが使用済みです。
 
 
 - 1分間のビデオは、150MBの容量を必要とします。
    
 */
/*:     
 - callout(演習): このiPhoneに何分間のビデオを保存できるかをユーザーに通知する文字列を作成してください。最初に計算ステップを実行し、それから文字列補間を使用して答えを表示します。次のように表示されるようにします。
 */
/*: 
 `約XXX分間のビデオを撮影できます。`
 
 ヒント: すべての計算はメガバイトで行ってください。
 */






/*:
 _Copyright (C) 2017 Apple Inc. All Rights Reserved._\
 _このサンプルのライセンス情報については、LICENSE.txtを参照してください。_
 */
//:
//: [前ヘ](@previous)  |  16／16ページ
