/*:
 ## さらに比較する
 
 比較演算子`==`は非常に便利ですが、すべての数について等しいかどうかチェックしていたら大変です。幸い、数を比較する方法はほかにもあります。
*/
// より小さい
1 < 2
2 < 2
3 < 2

// より大きい
1 > 2
2 > 2
3 > 2
/*:
 2つの記号を並べて1つの意味を表す比較もあります。
*/
// 等しくない
1 != 2
2 != 2
2 != 1

// 以下
2 <= 2
1 <= 2
3 <= 2

// 以上
1 >= 2
2 >= 2
3 >= 2

/*:
 これらの比較の結果を、結果サイドバーで確認してください。👉
*/
/*:
 - note:(注意): `>`と`<`の意味を覚えるには、いつも大きい方の値を食べる欲張りな口を思い浮かべてください。\
 🎂>🍰

*/
/*:
 - callout(演習): 比較文をいくつか記述してみてください。小数や文字列など、整数以外のものを比較しようとするとどうなりますか？
*/




//: 次のページで、コードに判断ポイントを追加する方法を学習します。
/*:
 */ 
//: [前ヘ](@previous)  |  4／13ページ  |  [次は「条件文」です。](@next)
