/*:
 ## 実例
 
Swiftの型について学習し、それが実世界のものの型と似ていることを確認しました。
*/
/*:
実世界のあらゆる型には、実際の物理的なインスタンス（実例）がたくさんあります。
 */
/*:
- 「車」という型を例に挙げれば、路上には数え切れないほどのバリエーションの「車」があり、それぞれに独自の走行距離、メーカー、モデル、色、燃料レベル、傷、へこみがあります。それぞれの車には、スタート、ブレーキ、シフトなど独自の方法で行う特定の動作のセットもあります。
    
     
- 「都市」という型を例に挙げると、都市という各インスタンスには、異なる名前、人口、場所、ランドマークがあります。また各都市は、緊急時の対応やごみの収集など、それぞれ決まった方法でものごとを行っています。
 */
/*: 
型は、特定の種類のもののプロパティと動作を定義または記述します。しかし、型の各具体例（それぞれの車、それぞれの都市）は、個別に独立した型のインスタンスです。
 */
/*:
同じ年に同じメーカーが作った同じモデルの2台の車を考えてみましょう。1台は高速道路で速度が低下し、もう1台は路肩でガソリンがなくなります。同じ型でも2つの異なるインスタンスです。
 */
/*:
次に、2つの都市を考えます。各都市は異なる場所にあります。一方の都市のランドマークは多くの旅行者を引きつけていますが、もう一方の都市のランドマークはさびれていて訪れる人はあまりいません。どちらも都市ではありますが、それぞれの都市は大きく異なっている可能性があります。
 */
/*:
プログラミングでは、ある型の異なるインスタンスを作成して使うことができます。各インスタンスには独自のプロパティ値のセットがあり、各インスタンスはほかのインスタンスと無関係に動作を実行できます。
 */
/*:
次は、コードの中のインスタンスをいくつか見てみます。
 */
/*:
1／17ページ  |  [次は「インスタンス」です。](@next)
*/
