//: ## コメント
//: プログラマは、コードをわかりやすくするためにコード内にちょっとしたメモを残します。こうしておくと、後でコードを読んだ時にコードを理解しやすくなります。このようなメモを「コメント」と呼びます。\
//:\
//: Playgroundはコメントを無視するので、コードがどのように実行されるかには影響しません。\
//: \
//: コメントは、2本のスラッシュ「//」から始まります。
// これはコメントです。コードには影響しません。
34 + 56 + 230
//: コメントは無視されるので、そのコード行に関しては結果バーに結果は表示されません。
// 200 + 34 + 45
//: - experiment:(実験):
//:計算「`34 + 56 + 230`」の最初に2本のスラッシュを追加し、コメント化してみてください。\
//:計算「`200 + 34 + 45`」の2本のスラッシュを削除し、コメントを解除してみてください。\
//:既存の式の一部を編集したり、追加してみてください。\
//:変更するたびに、サイドバーに表示される結果がアップデートされます。
//: 
//:\
//: それでは、次のページに進みましょう。\
//:\
//:[前ヘ](@previous)  |  4／7ページ  |  [次は「うまくいかない時」です。 😰](@next)
