/*:
 ## 演習問題：目標

毎日測定できる目標を何か1つ考えてください。エクササイズの時間でも、友達に送る写真の数でも、睡眠時間でも、小説を何ワード書き進めたかでもかまいません。
*/
/*:
 - callout(演習): 毎日の活動を表す20〜25件のサンプルデータを持つ配列リテラルを作成します。例えば、`let milesBiked = [3, 7.5, 0, 0, 17 ... ]`のようになります。数字は適当に入れてかまいませんが、自分が考えている目標より大きい数字、小さい数字、目標どおりの数字を必ず含めてください。ヒント：データに適した配列の種類（`[Double]`または`[Int]`）を選択してください。
*/

//: - callout(演習): 毎日記録する数を引数として取り、メッセージを文字列として返す関数を記述します。記録が目標にどれだけ近いかによって異なるメッセージを返します。どのようなメッセージでもかまいませんが、毎日の進捗状況に応じて少なくとも2種類のメッセージを返すようにしてください。
/*:
*/



//: - callout(演習): `for…in`ループを記述し、サンプルデータを処理して各アイテムに適したメッセージを取得する関数を呼び出し、コンソールにメッセージを出力します。
/*:
 */





//: [前ヘ](@previous)  |  16／17ページ  |  [次は「演習問題：メッセージの絞り込み」です。](@next)
