/*:
 ## ライブビュー
 
 ライブビューは作品をアップデートするとすぐに確認できるPlaygroundの機能です。「文字列」のPlaygroundで行ったように、インラインの結果を追加する必要はありません。ライブビューではアニメーションを再生することもできます。
 */
/*:
 このPlaygroundには特別な機能が隠されていて、BoogieBotの機能を使うことができます。この機能は、ほかのPlaygroundでは機能しません。
 */
/*:

 始める前に、Playgroundでライブビューが機能する設定になっていることを確認します。以下のコード行は、BoogieBotを設定してダンスをさせます。
*/
runBoogieBotDemoMode()

/*:
 右側の**アシスタントエディタ**にライブビューが表示されます。👉
 */
/*:
そこに何も表示されない場合は、「View」>「Assistant Editor」>「Show Assistant Editor」を選択してください。エディタエリアが2つに分割されるはずです。
 */
/*:
アシスタントエディタには、Playgroundのタイムラインが表示されているはずです。表示されない場合は一番上のバーの最初のエントリをクリックして「Timeline」を選択してください。すると、このようになります。
 */
/*: 
 ![](TimelineSelected.png)
 */
/*:
 BoogieBotの動きをアシスタントエディタで確認できます。
 */
/*:
 次のページでは、曲に合わせてBoogieBotにダンスをさせます。
 */
/*:
 [前ヘ](@previous)  |  2／13ページ  |  [次は「ダンススクール」です。](@next)
*/
