/*:
 ## 真か偽か
 
 「20の質問」というゲームでは、「はい」か「いいえ」で答えられる質問だけで答えを突き止めます。シンプルに答えられる質問は、とてもパワフルです。
 */
/*: 
 質問として考えられるコードを記述すると、Swiftが _true_ か _false_ で答えます。計算を入力した時と同じように、サイドバーに結果が表示されます。
 */
/*: 
 実際に、`true`と`false`はSwiftにおいて特別な値です。
*/
true
false
//: 数や文字列と同じように定数に代入できます。
let yes = true
yes
let no = false
no
/*:
 */
//: `true`と`false`の値を「ブール値」と呼びます。これは、シンプルな答えを持つ明確な質問をすることの重要性に気付いた19世紀の数学者、ジョージ・ブールに由来します。Swiftで使用される`Bool`型は、ブール値を表します。`Bool`値にはtrueとfalseしかありません。以下のコード行はエラーになります。
//let perhaps = maybe
//: `true`と`false`が答えなら、どのように質問すればよいのでしょうか？
/*:
*/
//: [前ヘ](@previous)  |  2／13ページ  |  [次は「等式」です。](@next)
