/*:
 ## これは何をする？
 
 プログラマとして習得する最も重要なスキルの1つは、マニュアルの中で必要な情報を見つけたり理解したりできることです。このスキルの習得は、インスタンスメソッドやプロパティのリストを覚えるよりもはるかに重要です。
 */
/*:
 すでに記述されているコードについて知りたい場合は、Optionキーを押しながら型、メソッド、プロパティをクリックするだけで有用な情報が表示されます。
 */
/*:
 ![Optionキーを押しながらクリックすると表示されるマニュアルポップアップ](OptionClickMethod.png)
 */
/*:
 - callout(演習): Optionキーを押しながら下の値とメソッドをクリックして、ポップアップ内のドキュメントを表示します。
*/
let example = "It was the best of times"
example.hasPrefix("It was")
example.hasSuffix("times")
example.isEmpty

/*:
*/
/*:
 次に、コードと同時にヘルプを表示する別の方法を見ていきましょう。
 */
/*:
[前ヘ](@previous)  |  9／17ページ  |  [次は「クイックヘルプ」です。](@next)
*/
