/*:
 ## 変数の宣言
 
 変数の宣言は、定数の宣言とほとんど同じです。ただし、キーワード`let`の代わりにキーワード`var`を使います。
*/
// 定数を宣言する
let placeOfBirth = "New Jersey"

// 変数を宣言する
var currentLocation = "New Jersey"

/*:
 変数を宣言した後に、新しい値を代入できます。
*/
// 変数に新しい値を代入する
currentLocation = "California"

/*:
 - experiment:(実験): 以下にコード行を追加し、`currentLocation`に新しい値を代入してください。
*/
// 新しい値を代入する

/*:
 定数と変数には、多くの共通点があります。
- 名前についてのルールが同じ
- どちらも名前と代入値を関連付ける
- どちらも特別な種類がある
 */
/*: 
 以下の違いがあります。
 - 定数の値は、最初に代入した後は変更できない
 - 変数の値は、最初に代入した後に変更できる
 */
/*:
次は、変数の使い方を学びます。
*/
//: [前ヘ](@previous)  |  3／13ページ  |  [次は「変数を使う」です。](@next)
