
/*:
 ## Hello

 `print`コマンドは、Swiftプログラムに対して、コンソールにメッセージを送るよう指示します。次のような文字列で使うことができます。
 */
/*:
`print("Testing, one two three.")`
 */
/*:
 コンソールに送る最初のメッセージができました。プログラマの多くは、最初のプログラミング言語を学ぶ時も、50個目の言語を学ぶ時も、「Hello」から始めます。
 */
/*: 
 でもこれは、ただの「Hello」ではありません。この最初のHelloは、世界に向かって挨拶する大きな一歩なのです。これは、皆さんが以前にこのレッスンで学んだ、プログラマの長い伝統です。
 */
/*: それでは、コンソールで「Hello, world!」と元気に挨拶しましょう。正式なやり方ではこの2つの単語をそのまま使う必要がありますが、好きなように表記してかまいません。
 */
/*:
 - callout(実験: Hello, world):
 上のサンプルコードのように`print`コマンドを入力します。括弧の中の挨拶文「Hello, world!」の部分は、好きなように入力してください。
*/

// この行のすぐ下に挨拶を追加し、コンソールに表示されるのを確認します。


/*:
 おめでとうございます！わずか1行のコードで大騒ぎをしているように思われるかもしれませんが、これであなたは長いプログラミングの伝統を受け継いだことになります。画面と一緒に記念のセルフィーを撮影したい方は、どうぞ。
*/
//: [前ヘ](@previous)  |  5／11ページ  |  [次は「プログラマからのメッセージ」です。](@next)
