/*:
 ## クイックヘルプ
 
 Xcodeでは、Optionキーを押しながらクリックすることでポップオーバーを表示できますが、クイックヘルプインスペクタでも同じ情報を見ることができます。
 */
/*:
 これを表示するには、メニューから「View」>「Utilities」>「Show Quick Help Inspector」を選択してユーティリティエリアを表示します。
*/
/*:
 カーソルの位置に応じて、クイックヘルプインスペクタにコードの説明が表示されます。
*/
let example = "It was the best of times"
example.hasPrefix("It was")
/*: 
 例えば、`hasPrefix`というテキストの辺りにカーソルを置くと、インスペクタにそのメソッドの定義が表示されます。
 */
/*:
 ![hasPrefixメソッドのクイックヘルプ](QuickHelp.png)
 */
/*:
 - callout(演習): 上のコード内でカーソルを移動し、クイックヘルプインスペクタを確認してください。どこに移動すると役に立つ情報が表示されますか？どこに移動すると役に立つ情報が表示されませんか？
 */
/*:
 次は、この情報の出所について学習します。
 */
/*:
[前ヘ](@previous)  |  10／17ページ  |  [次は「適切なマニュアルを使う」です。](@next)
*/


