//: ## ペットの問題
//: あなたの友達がペットショーを開こうとしているとします。友達は、各種類の動物が何匹来場するか把握する必要があります。\
//: また、来場する動物の合計数と哺乳類（mammals）の数も知る必要があります。\
//:\
//: あなたの手元にあるのは、Xcode がインストールされたラップトップだけだとします。Playgroundを使えば友達の力になれるはずです。\
//:\
//: これまでに身につけた知識を使えば、次のようなコメントと数を使って各動物の数を把握できます。
// Number Of Dogs（犬の数）
5

// Number Of Cats（猫の数）
4

// Number Of Turtles（カメの数）
3
//: コードの新しい行にそれらの数字をコピーすれば、Playgroundが計算をしてくれます。
// Total Number Of Animals（動物の合計数）
5 + 4 + 3

// Total Number Of Mammals（哺乳類の合計数）
5 + 4
//: - experiment:(実験): 後日、ショーに来場するペットについて、さらに情報が入りました。\
//:上のコードを変更して、合計数をアップデートしてください。
//:    
//: 例えば、もう1人犬を連れてくる人がいる場合、「`Number Of Dogs`」を`5`から`6`に変更し、犬の数が出てくるすべての場所（「`Total Number Of Animals`」と「`Total Number Of Mammals`」）で`5`を`6`に変更します。\
//:\
//: 新しい種類の動物を連れてきた人がいたら、ほかの動物のカウントと同じパターンを使います。新しいコメント（`// Number Of Hamsters`など）の行と、その数を含む次の行を追加します。合計をアップデートすることも忘れないでください。
//:
//: - さらにもう1人が犬を1匹連れてくる。
//: - 1匹のカメが病気で来られない。
//: - さらにもう1人が猫を1匹連れてくる。
//: - だれかがハムスター（哺乳類）を1匹連れてくる。
//:
//:  この問題を解決する、もっとよい方法はないでしょうか？少し考えてから次に進んでください。\
//:\
//:[前ヘ](@previous)  |  2／14ページ  |  [次は「ペットの問題のまとめ」です。](@next)
