/*:
 ## お気に入りのシャツ
 
 お気に入りのシャツを思い浮かべる時、バナナは浮かばないでしょう。それではつじつまが合いません。バナナはシャツではありません。
 */
/*: 
 一方、好きな果物について考える時は、バナナやリンゴなど、ほぼ間違いなく何らかの果物を思い浮かべます。
 */
/*: 
 「好きな果物」のように人が何かに名前を付けるとき、その名前は普通、特定のタイプのものに関連付けられています。
 */
/*: 
 「好きな果物」という考えは、ある種の果物に関連付けられることで、初めて意味を持ちます。「レンチ」や「宇宙飛行士」と関連付けても何の意味もなしません。人間の脳は優秀なので、いつも名前を正しいタイプのものと組み合わせてくれます。
 */
/*: 
 同様に、Swiftは定数と変数に関連付けられる値の型を追跡し、シャツの話をしている時に誤ってバナナという値を使わないようにします。
 */
/*: 
 次に、型と変数について学習します。
 */
/*: 
[前ヘ](@previous)  |  3／13ページ  |  [次は「型と変数」です。](@next)
*/

