/*:
 ## まとめ
 
 このPlaygroundでは、仕事に役立てるためにほかの開発者から提供される関数のセット、APIの概念について学習しました。
 */
/*: 
 ここまでプログラミングの基礎を学習しました。次は、APIを使った作業についてさらに学習していきます。
 */
/*: 
 また、関数の使用と定義、繰り返される作業を関数でグループ化する方法についても、練習しました。
 */
/*: 
 ダンスのルーチンは、あらかじめ決められたシーケンスを繰り返し実行するものなので、関数の中に関数を組み入れ（その中にも関数を入れ...）る構造は、素晴らしいダンスを作るのに最適です。
 */
/*: 
 レッスンの最後には作品に署名し、友達と共有できるようにGIFにしました。
 */
/*: 
 この後の数ページは空白のBoogieBotなので、先ほどの作品を上書きすることなく、いくつかのルーチンとGIFを作成できます。関数のグループを使って、面白いものを作るチャンスです。ぜひ試してください。
*/
runBoogieBotDemoMode()
/*:
 */
//:[前ヘ](@previous)  |  9／13ページ  |  [次は「Boogieのワークショップ」です。](@next)
