/*:
 ## 適切なマニュアルを使う
 
 ポップオーバーとクイックヘルプインスペクタはどちらも、特定のAPI用に提供されているマニュアルから情報を取得しています。
 */
/*:
 ポップオーバーまたはクイックヘルプインスペクタの一番下にあるリンクを使うと、マニュアル本体にアクセスできます。
 */
/*:
 ![マニュアルへのリンク](LinkToDocs.png)
 */
/*:
 また、Xcodeメニューの「Window」>「Documentation and API Reference」からも、マニュアルに直接アクセスできます。この操作を行うと新しいウインドウが開き、マニュアルビューアが表示されます。
 */
/*:
 - callout(演習): 上の手順に従ってマニュアルビューアを開き、ウインドウの上部にある検索バーを使って`String`を検索してください。`String`型に関する説明を確認します。
 */
/*:
 検索結果はこのように表示されます。最初の項目を選択すると、`String` APIの説明が表示されます。
 */
/*:
 ![Stringの検索結果](StringSearch.png)
 */
/*:
>(注意): マニュアルは「あらゆること」をカバーしているので、非常に複雑に見えることがあります。Wikipediaの情報をすべて読み、理解し、覚える必要がないように、マニュアルの情報をすべて読み、理解し、覚える必要はありません。必要な時に必要な情報を得るために使ってください。
 */
/*:
 次は、マニュアルでよく見る、型を宣言する2つの方法について学習します。
*/
/*:
*/
//: [前ヘ](@previous)  |  11／17ページ  |  [次は「クラスと構造体」です。](@next)
