/*:
 ## タイムトラベル
 Xcodeでいくつかプロジェクトのコードを記述しましたが、Xcodeのデフォルトモードでは、多くの人がイメージするコードと少し外観が異なることに気づいたかもしれません。

 Playgroundで作業する時に目にするコード：
   ![白の背景に複数色のテキストが表示されたコードサンプル](NowTimeyCode.png)
 わずかな時間でハッキングを試みる大胆なプログラマの画面に表示されるコード：
   ![黒の背景に緑色のテキストが表示されたコードサンプル](OldTimeyCode.png)
 
 これらのコードサンプルはまったく同じように動作し、同じ結果が得られます。では、なぜ映画やテレビ番組ではコードを表示するのに黒地に緑のスタイルを使い続けているのでしょうか？

 話は、人々がプログラミングに使った最初の画面にさかのぼります。[TODO：この理由を調査する]

 最近では、目に優しい（特に暗い部屋で仕事をする場合）という理由、または昔の大胆なプログラマを思わせるという理由で黒の背景を選ぶプログラマもいます。

 皆さんはどちらの配色を使ってコードを記述してもかまいませんが、このPlaygroundプロジェクトでは、昔のスタイルを継承しましょう。心の準備ができたら次のページに進み、指示に従ってXcodeの配色をアップデートしましょう。

 さあ、過去に向かって出発です！

*/

