//: ## 識別子
//: Swiftでは、名前のことを正式には「識別子」と呼びます。識別子（_identifier_）という語を最もよく目にするのは、エラーメッセージ内です。プログラマは通常、普段の言葉で「名前」と呼んでいます。皆さんに慣れていただくため、このコースでは両方の語を使います。\
//:\
//: 定数の名前は小文字から始まります。下の例のように、複数の単語を含める時は（スペースを入れずに）全部続けてください。間にスペースが入っていると、Swiftでは各単語が別の識別子だと判断されるからです。\
//:\
//:複数の単語を含む識別子を読みやすくするため、2つ目以降の単語は大文字で始めます。名前の中の大文字がラクダのこぶ🐫のように見えることから、このような名前の記述方法を「キャメルケース」と呼びます。
let numberOfDogs = 6 + 2

let numberOfCats = 5 - 1

let numberOfTurtles = 2 + 1

let numberOfHamsters = 1 + 1

let totalNumberOfAnimals = numberOfDogs + numberOfCats + numberOfTurtles + numberOfHamsters

let totalNumberOfMammals = numberOfDogs + numberOfCats + numberOfHamsters

//: - experiment:(実験): ペットショーに来場するペットについて、さらに変更がありました。\
//:新しい種類の動物を追加するため、新しいコード行を追加して新しい定数を定義してください。（新しいコード行を追加するには、上の領域の空白行をクリックしてタイプしてください）
//:
//: 以下の変更を行ってください。
//: - だれかがミニブタ（哺乳類）を1匹連れてくる。
//: - だれかが魚（哺乳類ではない）を1匹連れてくる。
//: - だれかがヘビ（哺乳類ではない）を1匹連れてくる。
//:
//: 次は、名前の選び方を学びます。 \
//:\
//:[前ヘ](@previous)  |  6／14ページ  |  [次は「よい名前を選ぶ」です。](@next)
