/*:
 ## プログラマからのメッセージ
 
 結果を表示する素晴らしいサイドバーがあるのに、コンソールに出力するのはなぜでしょうか？
 */
/*:
 - 結果サイドバーは、Playgroundsの機能です。Xcodeでアプリケーションを作成する時は、結果サイドバーはありません。
    
     
 - 結果サイドバーは、1行にわずかな情報しか表示できません。
     
     
 - ほかの人が記述したコードを使っている時は、コードについての直接的なメッセージがコンソールに表示されます。例えば、下の行のコメントを解除してコンソール出力を確認してください。
*/
//theAnswer

/*:
 コンソールにたくさん表示されています。コンソールにすべてのテキストが収まらない場合は、上のバーを上にドラッグしてコンソールエリアを広げるか、テキストを縦にスクロールしてください。
 */
/*: 
 - note:(注意):
 Xcodeの設定によって、メッセージが通知されるたびにコンソールが開くことがあります。作業の間、コンソールを開いたままにしておいてもかまいません。コンソールエリアがコードの邪魔になる場合は、上のバーをドラッグして小さくできます。
 */
/*:
 次に、コンソールに何を送れるかを確認します。
 */
/*: 
[前ヘ](@previous)  |  6／11ページ  |  [次は「出力できるもの」です。](@next)
*/
