/*:
 ## 演習：カラオケマシン

 大勢でカラオケをするのが大好きな友達がいます。歌う人が好きな曲をリストに追加すると、カラオケマシンが1曲ずつ呼び出してくれます。 
 */
/*:
 あなたは、友達からソングリストを管理するソフトウェアを作ってほしいと頼まれました。
 */
/*:
 - callout(演習):
 曲名を文字列として保持する空の配列を作成し、`append`メソッドを使って一度に3、4曲追加します。
*/




/*:
 - callout(演習):
 カラオケ好きなある人が、一度に3曲追加したいと言っています。この人のソングリストを保持する配列を作成し、`+=`演算子を使って、グループのソングリストの最後にリスト全体を追加してください。
*/





/*:
 - callout(演習):
 `for…in`ループを記述し、配列内のすべての曲名で、次に歌う人に順番が来ることを知らせるメッセージを出力してください。
*/






/*:
 - callout(演習):
 歌う人全員がループで呼び出されたら、`removeAll`メソッドを使ってソングリストから過去の曲すべてを消去してください。
*/




//: [前ヘ](@previous)  |  14／17ページ  |  [次は「演習問題：票を数える」です。](@next)
