//:  ## うまくいかない時 😰
//: プログラマは、ミスをすることがあります。\
//: （皆さんが考えているよりも頻繁にミスをします）\
//:\
//: あなたも、コードを記述してアプリケーションを構築する時にミスをするでしょう。\
//:   \
//: あわてる必要はありません。\
//:    \
//: 標準的な当たり前のコードを記述していても、うまくいかない時があります。\
//: すべてが何のエラーもなくうまくいくことは、まずありません。\
//:\
//: うまくいかない時のトラブルシューティングは、プログラマの大切な仕事です。\
//: \
//: まずは、落ち着きましょう。深呼吸をしましょう。 \
//:    \
//: あわてる必要はありません。\
//:    \
//: エラーになっても、失敗したとか、プログラマとして未熟だというわけではありません。\
//: コードに問題があって、修正が必要なだけです。\
//:    \
//: これも1つのプロセスです。\
//:    \
//: 次のページで、Playgroundがどのようにエラーを見つけてくれるかを確認しましょう。\
//:\
//:[前ヘ](@previous)  |  5／7ページ  |  [次は「エラー」です。](@next)
