/*:
 ## 着替え
 */
/*: 
 友達から映画に誘われたとします。遅くまで寝ていたあなたは、こう答えました。「待ってて。着替えなくちゃ」
 */
/*: 
 友達は、「着替え」が何を意味するかは知っていても、どのシャツを着るか、といった詳しいことはわかりません。
 */
/*: 
 ここで、今日、着替えるためにするすべてのことを詳しく考えてみましょう。何を着るか決め、タンスかクローゼットから服を出し、それらの服を身につけます。
 */
/*: 
 「着替え」という言葉はシンプルに見えても、そこに含まれる詳細を考えると、たくさんの複雑なことを表しているのがわかります。
 */
/*: 
 「着替え」という言葉を使えば、具体的にすべてのことを考えなくても着替えのプロセスについて話したり考えたりできます。
 */
/*: 
 人は、このようなことを常に行っています。「歯医者に行く」「サンドイッチを作る」「コーヒーを飲みに行く」のようなフレーズは、細かいステップを1つずつ説明していたら長くなってしまうような行動を言い表します。
 */
/*: 
 複雑なことを表すシンプルな方法を定義する、という考え方を「抽象化」と呼びます。*抽象化*は、ソフトウェア開発における基本的な考え方です。これによってプログラマは、細かいことや複雑なことに忙殺されずに済みます。
 */
/*: 
 このレッスンでは、コードで抽象化を定義する最も基本的な方法の一つである「関数（Functions）」の定義および使い方について学習します。
 */
/*: 
 - experiment:(実験):少し時間を取って、複雑な行動やアイデアを表すシンプルなフレーズを考えてください。
 */
/*: 
 次は、プログラマもシンプルなフレーズを使って複雑な演算を表していることを学習します。
 */
/*: 
 1／12ページ  |  [次は「関数を呼び出す」です。](@next)
*/
