/*:
 ## 演習問題：応援歌
 
  多くの学校には「応援歌」があります。学生たちは少なくとも歌詞の一部を覚えて、体育祭などのイベントでみんなと一緒に大きな声で歌います。
 */
/*:
  学校の応援歌を作り直す必要があると決定したとします。作業中に何度もコピー＆ペーストしなくても済むようにコードで歌詞を編集したいと考えています。

 1. `song`を編集して、何度か繰り返される反復句を入力します。
 
 
 2. `refrain`を編集して、実際の歌詞を入力します。
 
 
 3. `schoolName`を2回以上使用するように`refrain`を編集します。
 
 
 4. 学校名を架空の学校の名前に変更して、処理をテストします。
 */
/*: 
 作成した歌を別の学校に売ることにした場合、文字列補間を使用します。
 */
/*:
 - note:(注意):
 実行結果を表示するには、結果を表示するボタンを使用します。
 */


let schoolName = "YOUR SCHOOL NAME"
let refrain = "hmm hmm HMMM hm-hmm \(schoolName) hmm hmm HMMMMM"

let song = "\(refrain)\n\(refrain)\nYes, \(refrain)"



//:
//: [前ヘ](@previous)  |  15／16ページ  |  [次は「演習問題：値の表示」です。](@next)
