//: ## Playgroundとは？
//: Playgroundは、コードで遊んだり実験ができる場所です。すぐに結果がわかり、何も難しいことはありません。Playgroundには、（このテキストのような）説明部分と、コードの入力や変更を行ってすぐに結果を確認できるライブビューの部分があります。\
//:\
//: 最も簡単に記述できるコード行は、数字です。
765
//:👆上の数字は、ほかの部分と違っているのがわかりますか？
//: このスタイルで書かれているテキストは「編集可能コード」です。何かをするために、記述したり変更したりできる部分です。\
//:\
//: 負の数を表現するには、マイナス記号を使います。
-1200
/*:
右側のグレーの部分にも数字が表示されていますね？👉\
\
この部分を「結果サイドバー」と呼びます。コードを追加したり変更したりすると、Playgroundでコードが再び実行され、サイドバーの結果がアップデートされます。
*/
/*:
    
 - experiment:(実験):
    - コード行をクリックして、カーソルをそこに移動します。
    - タイプしてコードの編集を始めます。
    - 何回か、数字を変更します。
    - 1行に1つずつ、新しい数字を追加します。\
変更するたびに、サイドバーに表示される結果がアップデートされます。
 */
/*:    
次に、結果サイドバーを使いやすいように配置する方法を学びます。\
 \
 [前ヘ](@previous)  |  2／7ページ  |  [次は「計算」です。](@next)
*/
