/*:
## 関数を呼び出す
 
皆さんは気付いていなかったと思いますが、`print()`を使って「Hello, world!」をコンソールに出力した時、抽象化と関数をすでに使っていました。Swiftにおいて、`print()`は関数です。これを使うことを、関数を「呼び出す」と言います。
*/
print("Hello, world!")
print(360)
/*:
着替えをする時にたくさんの行動をするように、`print()`関数を呼び出すと、次のように多くのことが起こります。
- 数字など、渡されたものをすべて文字列に変える。
     
     
- `print()`の呼び出しは新しい行で終わるように、改行文字を追加する。
    
     
 - その文字列がコンソールに表示されるようにする。
 */
/*: 
この場合、あなたは、ほかの人が作成した関数を呼び出しています。`print()`がどのように機能するか詳しく知らなくても、呼び出すことができます。
 */
/*: 
関数がパワフルな理由は、ここにあります。関数によって、細かい手順を1つの定義にまとめ、何度も使うことができます。
 */
/*: 
このPlaygroundでは、関数を呼び出す練習を行い、自分の関数を定義する方法を学びます。
 */
/*:  
 [前ヘ](@previous)  |  2／12ページ  |  [次は「同じことを繰り返す」です。](@next)
*/
