/*:
 ## コンソール
 
 タッチスクリーンディスプレイ、マウス、トラックパッドといったものが登場する前、コンピュータとのやり取りはすべてテキストベースで行っていました。
 */
/*:
 皆さんはプログラマですから、舞台裏に回って、普通のユーザーが見ない場所を見てみましょう。
 */
/*:
 その1つが「コンソール」と呼ばれるものです。
 */
/*:
 ビデオゲームやテレビ台などの説明でコンソールという言葉を聞いたことがあるかもしれません。プログラミングにおけるコンソールは、プログラムがどのように動いているかを詳しく表示するメッセージセンターのことを言います。
 */
/*:
 #### コンソールを表示する
 コンソールを表示するには、Xcodeウインドウの左下にあるこのボタンをクリックします。![コンソールボタン](console_button.png)
 
 */
/*:
 または、Xcodeウインドウの右上にある真ん中のボタンをクリックします。 ![パネルの表示／非表示を切り替える3つのボタン](xcode-show-debug-area.png)
 */
/*: 
 コンソールの表示／非表示を何度か切り替えてみてください。最後は、コンソールが表示された状態にします。
 */
/*: 
 コンソールの高さを調整するには、コンソールの上部のバーを上下にドラッグします。
   ![ボタンでコンソールを表示／非表示にするアニメーション](show-hide-console.mov)
*/

 let charactersRemaining = 140 - 97
 let micTest = "Is this thing on? "

/*:
 上のコードを実行しても、何のフィードバックもありません。コンソールが空なのは、プログラマが出力するよう指示した時しかコンソールにメッセージが表示されないからです。
 */
/*: 
 次のページでは、いよいよプログラマの社会にデビューします 🎓。
*/
//: [前ヘ](@previous)  |  4／11ページ  |  [次は「Hello」です。](@next)
