//: ## 文字列
//: どのアプリケーションを見ても、テキストが表示されます。テキストは、メッセージングアプリケーション、ニュースリーダー、ソーシャルメディアサービスなどあらゆる場所に存在します。カメラアプリケーションでさえ、ラベルボタンやコントロールにテキストが使用されているかもしれません。\
//:\
//: Swiftを含むほとんどのプログラミング言語では、テキストの値を「文字列（Strings）」と呼びます。
/*:
*/
//: ### 文字列と呼ばれる理由
//: 糸でつなぎとめられたビーズを想像してください。それぞれのビーズの形は異なっていても、特定の順序ですべてのビーズが一続きにまとめられています。\
//:\
//: ![糸でつなぎとめられたビーズ](StringOfBeads.png)\
//: 通常、1文字（例えば、「H」）は、それだけでは役に立ちません。一連の文字全体で単語を構成します。そのため、プログラマはテキストを「文字列」と呼びます。文字列は、想像できるどんなテキストにもなることができます。\
//:\
//: ![一連の文字](StringOfCharacters.png)\
//:\
//: 次に、文字列を構成する普通の文字以外の要素について考慮します。\
//:\
//:1／16ページ  |  [次は「文字」です。](@next)
