//: ## プログラマが使う言葉
//: アプリケーション開発者の仕事は、Xcodeに何をタイプするか考えるだけではありません。プログラマは、協力して、問題の解決方法を話し合ったり、お互いにものごとを説明し合ったりします。そこで、プログラマが使う用語を学ぶことが重要です。\
//:\
//: このコースでは、コードの記述方法とアプリケーションの作成方法を学びますが、ほかの開発者とコードについて話すために必要な用語についても学びます。\
//:\
//: 例えば、「コード行」はもっと正式な呼び方をすると「ステートメント（文）」です。\
//:\
//: このPlaygroundで、すでに「定数」や「識別子」という用語が出てきました。以下のステートメントを見て、さらにいくつかの用語を理解しましょう。
let numberOfDogs = 101
//: Swiftで定数を定義することを、定数を「宣言する」と言います。ですから、上のステートメントは「宣言文」です。「私は、名前`numberOfDogs`が値`101`を持つことを宣言します！」\
//:\
//: `let`という単語は、「キーワード」の例です。キーワードはSwiftにおいて特別な意味を持つ単語で、名前として使うことはできません。キーワード`let`は、定数を宣言するために使います。学習を進めていくと、Swiftのキーワードがさらに出てくるでしょう。\
//:\
//: ステートメントの中の「`= 101`」の部分で、定数に値を「代入」しています。これを「代入」と呼び、等号「`=`」を「代入演算子」と呼びます。\
//:
//: - note:(注意): 新しい用語をすべて覚えるのは大変かもしれません。一度にすべて覚える必要はありません。コースではこれらの用語が使われています。思い出す必要があれば、いつでも「ガイド」の「用語集」を参照できます。
//:
//:[前ヘ](@previous)  |  8／14ページ  |  [次は「まとめ」です。](@next)
