/*:
 ## リスト
 
 人はよくリストを使います。To-Doリスト、ウィッシュリスト、iTunesのプレイリスト。バケツリスト（死ぬまでにやりたいことのリスト）というのもあります。コードにおいても、リストはとても便利です。
 */
/*: 
 文字列について学習した時、演習でもののリストを作成しましたね。改行文字`\n`を使って複数の文字列を追加し、リストを作成しました。
 */
/*: 
 ```
(例): let shoppingList = "Eggs" + "\n" + "Tomatoes" + "\n" + ...
 ```
 */
/*: 
 このコードで作成されるリストは、画面に表示して読み上げるだけならよいのですが、それ以外ではあまり役に立ちません。リストでどのような処理をしたいか、考えてみてください。
 */
/*:
 - リストの各アイテムをすべて入力し直すことなく、各アイテムで関数を呼び出すにはどうすればよいでしょうか？
    
    
 - リストに何か追加したかどうかもう一度確認するには、どうすればよいでしょうか？    
 
 
 - リストのアイテムが何百もある場合に、「Tomatoes」というアイテムを簡単に削除できるでしょうか？    
 
 
 - リストが`String`値で構成されるのではなく、価格のリストで、それを合計したい場合はどうでしょうか？    
 
 
 - 最初のものは何ですか？最後のものは何ですか？24番目のものは何ですか？    
 
 
 - いくつのものがありますか？    
 
 
 - リストを並べ替えるにはどうすればよいですか？    
 
 
 */
/*:
 Swiftでは、リストを「配列（Arrays）」と呼びます。
 */
/*: 
  これまでに使ったことのあるiOSアプリケーションで、アイテムのリストをスクロールするものを考えてみてください。そのアプリケーションはまず間違いなく配列を使っています。
 */
/*:  
 このレッスンでは、配列の作成と処理について学習します。
 */
/*:
1／17ページ  |  [次は「配列リテラル」です。](@next)
*/
