//: ## エラー
//: Playgroundは、コード内のエラーを見つけるとコードの実行を中止します。\
//: 例えば、このPlaygroundページにはエラーがあります。\
//:\
//: 👈 下の行の左に、赤色のエラー記号が表示されています。Playgroundでは、このように問題箇所を教えてくれます。
1000 / 0
//: エラーがあるので、Playgroundはコードの実行を中止します。\
//: サイドバーには結果が表示されていませんね。 👉
2 + 2
//: 赤色のエラー記号をクリックすると、エラーに関する詳しい情報が表示されます。クリックしてみてください。\
//:\
//: クリックすると、そのコード行が赤色でハイライトされます。右側にエラーの説明が表示されます。\
//: もう一度クリックすると、エラーメッセージが非表示になります。\
//:\
//: ここでは、「Division by zero」というエラーがあります。算数の時間にゼロで割ることはできない、と習ったと思いますが、コンピュータもゼロで割ることはできません。
//:    
//:    
//:- experiment:(実験): 
//: `0`をほかの数字に変更して、エラーを修正します。
//:
//:\
//: 次に、ここまでのまとめをしましょう。\
//:\
//:[前ヘ](@previous)  |  6／7ページ  |  [次は「まとめ」です。](@next)
