/*:
## 結果サイドバーを非表示にする
 
結果サイドバーは頼りになる存在で、入力した計算の答えを自動的に表示してくれます。 👉 */
let sum = 1 + 2 + 3 + 4 + 5
let product = sum * sum

/*: 
 昔ながらのプログラミングにこだわるなら、このサイドバーを非表示にする必要があります。サイドバーの左端にゆっくりマウスを持っていくと、カーソルが両矢印に変わります。
 
 ![サイズ変更カーソル](resize-cursor.png)
 
 次にその端をクリックして右にドラッグし、サイドバーを小さくして計算結果全体が表示されるようにします。

   ![非表示になっているPlaygroundの結果ウインドウ](xcode-results-hidden.png)
 
 ドラッグして何回か開いたり閉じたりして、後から元に戻す方法を覚えておきましょう。
 */
/*:
 - callout(演習):
 上の数字をいくつか変更します。5を23857に、3を11かほかの数に変更してください。結果サイドバーがないので、結果を推測しなければなりません。
 */
/*: 
 結果サイドバーをまた表示したいと思いますか？この昔ながらの方法にも、プログラムの状態を調べるパワフルなツールがあります。
 */
/*:
 次のページに進んでコンソールについて学習しましょう。✨
*/
//: [前ヘ](@previous)  |  3／11ページ  |  [次は「コンソール」です。](@next)
