/*:
 ## API、ふたたび
 
 BoogieBotのところで、API（Application Programming Interface）の概念を学習しました。`String`のインスタンスメソッドとプロパティは、`String`型のAPIです。 
 */
/*:
 型が提供するAPIを見つける方法はたくさんあります。 
 */
/*:
 メソッドやプロパティの名前の一部を覚えている場合は、入力してみてください。Xcodeのオートコンプリート機能によって候補が表示されます。プログラマはいつもオートコンプリートのポップアップメニューを使っています。`String`インスタンスには、"`.has`"とタイプした場合のオートコンプリートの候補が表示されています。
 */
/*:
 ![オートコンプリート機能のポップアップ](Autocomplete.png)
 */
/*:
 ほとんどのオプションの意味がわからなくても、今は気にしないでください。見覚えのある`hasPrefix`がありますね。また、`hasSuffix`がどのような処理を行うのかも、おそらく見当がつくでしょう。多くの文字を入力していくと、リストに表示されるオプションが絞り込まれます。カーソルキーを使ってオプションを選択するか、Tabキーを使って終了し、入力し続けることもできます。
 */
/*:
 - callout(演習): オートコンプリートのポップアップを使って`isEmpty`、`hasPrefix`、`hasSuffix`のプロパティ、および`example`のメソッドにアクセスしてください。キーボードを使ってオプションを選択します。
*/
let example = "It was the best of times"
// この練習では、"example"の後にピリオドを入力します。
example






/*: 
 APIには、内容と使い方を知るのに役立つマニュアルも付属しています。
 */
/*:
[前ヘ](@previous)  |  8／17ページ  |  [次は「これは何をする？」です。](@next)
*/
