//: ## 名前の入力とオートコンプリート機能
//: Xcodeは、それまでに定義されたすべての名前を把握しています。入力を始めると、名前の候補（Xcodeが知っている名前）のメニューが表示されます。これを「オートコンプリート」と呼びます。\
//:\
//: オートコンプリートを使うと、より速くコードを記述でき、タイプミスを減らすことができます。多くの文字を入力するほど、オートコンプリートメニューに表示される候補が絞り込まれていき、目的のものが見つかります。\
//:\
//: オートコンプリートメニューが表示されている時は、次のことができます。
//: - 入力を続けてリストを絞り込む。
//: - 上向きおよび下向きの矢印を使って、リスト内で上下に移動する。
//: - Returnキーを押して、選択された名前を入れる。
//:
//: ![オートコンプリートポップアップメニュー](autocomplete.png)
//: リストの中に、定義していない名前があります。それらの名前は無視してかまいません。\
//:\
//: 次のページの実験で、名前を入力してオートコンプリートを使ってみましょう。\
//:\
//:[前ヘ](@previous)  |  5／14ページ  |  [次は「識別子」です。](@next)
