/*:
 ## 定数と変数
 
プログラミングでは、常に同じ値を参照する名前と、時と共に値が変わりうる名前には大きな違いがあります。
 */
/*: 
 実世界で物に名前を付ける場合にもその違いはありますが、普通は気づきません。
 */
/*: 
 #### 定数
 
 例えば、「あなたの誕生日」を考えてみます。あなたの誕生日が変わることはありません。あなたが何歳になっても誕生日の日付は同じです。あなたが素晴らしいアプリケーションを作って世界を変えたとしましょう。人々がたとえ何百年も先にあなたのことを本で読んでも、あなたの誕生日は変わりません。
 */
/*:
 あなたの誕生日は定数です。あなたが生まれた時に値が設定され、後から変わることはありません。コードでいえば、`birthdate`が定数になります。
 */
/*: 
 
 #### 変数
 
 人々が毎日使う名前の多くは、時と共に値が変わっていくことがあります。
 */
/*:
 例えば、「お気に入りのシャツ」など、お気に入りの洋服について考えてみます。子どものころ、お気に入りのシャツがあったのではないでしょうか。大きくなるにつれてサイズもデザインも合わなくなり、別のシャツがお気に入りになりました。いずれは別のシャツを好んで着るようになるでしょう。「お気に入りのシャツ」という名前や認識は変わらなくても、それが指す実際のシャツは時と共に変わります。コードでは、`favoriteShirt`が変数になります。
 */
/*: 
 #### その他の例
 多くのチームスポーツでは、定数と変数の両方を見ることができます。「ホームチーム」と「ビジター」という概念があります。あなたの学校では、いつも同じチームがホームチームです。あなたの学校にとって、ホームチームは定数です。一方、「ビジター」は名前や概念は同じでも、実際のチームは試合ごとに変わります。ビジターチームは変数です。
 */
/*: 
- experiment:(実験): 身の回りで、定数および変数に該当するものを探しましょう。手始めに以下のリストを使ってください。
  - あなたが生まれた場所
  - あなたが住んでいる場所
  - あなたの年齢
  - あなたの好きな映画
  - 足のサイズ
  - 米国の初代大統領
 */
/*:
*/
//: [前ヘ](@previous)  |  2／13ページ  |  [次は「変数の宣言」です。](@next)
