/*:
 ## ログへの記録
 
 船（または宇宙船）の船長は航海日誌（ログ）に航海に関するあらゆる情報を記録すると聞いたことがあるかもしれません。アプリケーションにもログがあるのを知っていましたか？
 */
/*:  
 プログラマがコンソールにメッセージを出力するのは、通常、プログラムの実行に関する情報を記録、すなわち「ログ」するためです。コンソールにメッセージを出力することを「ロギング」と言います。これらのメッセージは「ログメッセージ」と呼ばれることがあります。
 */
/*: 
 プログラマは多くの場合、ログメッセージを使って、何かがうまくいかなかったことや何か予期しないことが発生したことを示します。以下のように、メッセージによって警告したり、問題の診断を助けたりします。
 */
/*: 
 - callout(実験):
 結果サイドバーを開き、下の`addToScore()`ステートメントの数字を変えてみてください。警告が出力されない点数の最大値はいくつですか？
*/

addToScore(1)
addToScore(2)
addToScore(1)

/*:
 点数が最大になったら、結果サイドバーを非表示にします。また昔風になります。
 */
/*: 
[前ヘ](@previous)  |  8／11ページ  |  [次は「まとめ」です。](@next)
*/
