/*:
 ## まとめ
 
 このレッスンでは、特定の型の各値をインスタンスと呼ぶことを学習しました。
 */
/*:
 また、型は`String`や`Int`のようなただのラベルではなく、それぞれの型が追加機能を持つ場合があることも学びました。
 */
/*:
 型はプロパティを持つことができます。各インスタンスはプロパティによって独自の値セットを持つことができます。
 */
/*:
 型はインスタンスメソッドを持つことができます。インスタンスメソッドは、型の一部として定義される関数です。
 */
/*:
 Xcodeに組み込まれているマニュアルを使って、利用できるメソッドやプロパティについての情報を確認できます。マニュアルにアクセスするには、Optionキーを押しながらコードを直接クリックするか、クイックヘルプインスペクタを使います。また、別のウインドウでマニュアルブラウザを起動し、関心のある項目を調べることもできます。
 */
/*:
 `String`のように一見シンプルな型にも多くのメソッドとプロパティがあることを学習しました。
 */
/*:
 トップレベルで定義される関数としてではなく、インスタンスメソッドとプロパティとして定義するとよい理由を学習しました。
 */
/*:
 では、演習で練習しましょう。
 */
/*:
[前ヘ](@previous)  |  14／17ページ  |  [次は「演習問題：BoogieBotの再来」です。](@next)
*/

