/*:
 ## 型はどこから？ 
 
 Swiftには、すべてのプログラムの基本的な要素を表す型が組み込まれています。これまでに`String`と`Int`を何度も使ってきましたが、ほかにもたくさんあります。
 */
/*: 
 これらは「Swift標準ライブラリ」の一部です。すべてのプログラミング言語には、このような基礎的なプログラミングタスクに必要な機能の基本セットがあります。
 */
/*: 
 これまでに`String`型と`Int`型を何度も使ってきましたが、ほかにもたくさんの型があります。以下に、Swift標準ライブラリに含まれるそのほかの型をいくつか挙げます。ここではそれぞれの意味がわからなくてもかまいません。自由に推測してください。
 */
/*: 
 - `AnyCollection`
     
     
 - `JoinedSequence`
 
 
 - `CharacterView`
 
 
 - `Slice`
 
 
 - `Range`
 
 
 - `Int64`
 */
/*: 
 型名は大文字で始まっており、複合語の場合は、それぞれの単語の最初の文字も大文字です。この点が、小文字で始まる定数、変数、関数の命名規則と少し異なります。
 */
/*: 
 この違いは意図的なものです。型の名前は大文字で始まっているので、関数、変数、定数の名前でないことがすぐにわかります。どちらもキャメルケースを使いますが、型ではローワーキャメルケース（複合語の先頭を小文字で始める）ではなくアッパーキャメルケース（複合語の先頭を大文字で始める）を使います。
 */
/*: 
 - experiment:(実験): `TrainingShoe`や`RacingBike`など、独自の型を考えてアッパーキャメルケースで記述するとどのように見えるか確認してください。 
 */
/*:
 利用できる型はほかにもあります。次のページで、それらがどこからくるのか確認しましょう。
 */
/*: 
[前ヘ](@previous)  |  9／13ページ  |  [次は「標準ライブラリだけではない」です。](@next)
*/
