//: ## ペットの問題のまとめ
//: すべてのアップデートを行うと、Playgroundはこのようになっているはずです。
// Number Of Dogs（犬の数）
6

// Number Of Cats（猫の数）
5

// Number Of Turtles（カメの数）
2

// Number Of Hamsters（ハムスターの数）
1

// Total Number Of Animals（動物の合計数）
6 + 5 + 2 + 1

// Total Number Of Mammals（哺乳類の合計数）
6 + 5 + 1
//: Playgroundを使って、友達の問題を解決できました。各種類の動物の数、動物の合計数、哺乳類の合計数を把握できました。\
//:\
//: ただ、実験を行ううちに、ミスをしやすいことに気づいたかもしれません。複数の場所で数字を変更する必要がありましたね。すべての場所をアップデートしないと、合計が正しい数になりません。\
//:\
//: また、それぞれの動物の数を覚えておかなければなりませんでした。各数字を識別するためのコメントがなければ、数字をそのまま覚えておくのは非常に困難です。\
//:\
//: コードを記述する時に最も重要なことの1つは、何かに名前を付けることができる、ということです。同じものを指す数字が繰り返し現れる場合、それに名前を付けることができます。コード内でその数字が必要な時は、数字ではなく、その名前を使うことができます。\
//:\
//: 次のページでその方法を確認しましょう。\
//:\
//:[前ヘ](@previous)  |  3／14ページ  |  [次は「名前を付ける」です。](@next)
