/*:
 ## インスタンス
 
 皆さんは、すでに`String`などSwiftの様々な型を扱ってきました。"hello"のような個々の`String`値を、その型の「インスタンス」と呼びます。

 - `String`は型です。
 
 
 - `"hello"`は`String`の「インスタンス」です。
*/
/*:
ここしばらくは`Int`型と`String`型のインスタンスを作成してきました。実際に、プログラムの中で作成する各値はその型のインスタンスです。
*/
/*:
定数`hello`と`aDifferentHello`は、偶然同じデータを持つ2つの`String`インスタンスです。

*/
let hello = "hello"
let aDifferentHello = "hello"
/*: 
 
インスタンスの型によって、そこに含まれるデータの種類、およびコードでどのように使うことができるかが決まることを学習しました。
 */
/*:
また、文字列を追加してつなぐ、数の計算をするといったインスタンスの演算も行いました。でも、インスタンスのパワーはそれだけではありません。
 */
/*:
このPlaygroundでは、インスタンスの作成と使い方、およびその値と動作へのアクセスについてさらに学習します。
 */
/*:
次は、インスタンスを作成する新しい方法を説明します。
 */
/*:
[前ヘ](@previous)  |  2／17ページ  |  [次は「インスタンスを作成する」です。](@next)
*/
