/*:
 ## アルゴリズム

 このレッスンでは、動作を組み合わせて関数にすることによって、BoogieBotの様々なダンスルーチンを作成しました。コンピュータサイエンティストは、このレッスンで行ってきたことを「アルゴリズム」の開発と呼びます。
 */
/*: 
アルゴリズムの開発とは、実行すべき一連のステップを定義することです。もちろん、ダンスのステップである必要はありません。自己完結型の、段階的な一連の作業であれば、どのようなものでもアルゴリズムです。
 */
/*: 
アルゴリズムの定義は、プログラミングの大部分を占めます。インターネット上で効率的にビデオを送信するためのビデオ圧縮などのように、複雑な数学的アルゴリズムもあります。また、アプリケーションのユーザーが新着メッセージの有無を確認したり、メッセージがある場合は通知を表示したりするアルゴリズムのように、まったく数学に関係のないアルゴリズムもあります。そしてもちろん、ソフトウェアのロボットにダンスをさせるアルゴリズムもあます。
 */
/*: 
 次は、学んだことを振り返ります。
 */
/*: 
 [前ヘ](@previous)  |  8／13ページ  |  [次は「まとめ」です。](@next)
*/
