/*:
 ## 配列リテラル
 
 これまでリテラル値を使って、文字列、数値、およびブール値をコード内で直接作成してきました。「配列リテラル」を使うと、配列もコード内で直接作成できます。
*/
/*:
 配列リテラルはカンマで区切られたアイテムのリストで、アイテム全体が角括弧に入っています。
*/
let devices = ["iPhone", "iPad", "iPod", "iMac"]
/*:
 結果サイドバーでリストの上にカーソルを置き、丸い「Show Result」ボタンを使うとPlaygroundに配列インラインを追加できます。インライン表示では、配列の各アイテムが次のようにゼロから始まる番号を持っていることがわかります。
 
`0 "iPhone"`\
 
 
`1 "iPad"`\
 
 
`2 "iPod"`\
 
 
`3 "iMac"`
 */
/*: 
 - experiment:(実験): 上の`devices`配列リテラルのアイテムの順序や番号を変えてみましょう。結果表示のアイテムの順番は、リテラルに入力された順番と一致していますね。
 */
/*:
 
 - experiment:(実験): 以下に`highScores`という名前の新しい定数を作成し、10個の数字を含む配列を割り当てます。
*/
// 以下にhighScores配列を定義してください。

/*:

 
 これらの番号を何に使うかは、次のページでわかります。
 */
/*:
[前ヘ](@previous)  |  2／17ページ  |  [次は「インデックス」です。](@next)
*/
