//: ## 文字列
//: どのアプリケーションを見ても、たいていテキストが表示されます。テキストは、メッセージングアプリケーション、ニュースリーダー、ソーシャルメディアアプリケーションなどあらゆる場所に存在します。カメラアプリケーションでさえ、ラベルボタンやコントロールにテキストが使用されているかもしれません。ページ //:コンピュータサイエンスでは、テキスト値はたいてい「文字列」と呼ばれます。
//:
//: ### 文字列と呼ばれる理由
//: 糸でつなぎとめられたビーズを想像してください。それぞれのビーズの見かけが異なっていても（あるいは形自体が異なっていても）、特定の順序ですべてのビーズは一続きにまとめられます。
//: ![糸でつなぎとめられたビーズ](StringOfBeads.png)
//: 通常、1文字（例えば、「H」）をそれだけで使用するのは、あまり使い勝手が良くありません。一連の文字全体を一緒に組み合わせて単語、文、段落を作ります。そのため、プログラマはテキストデータを「文字列」と呼びます。
//: ![一連の文字](StringOfCharacters.png)
//: When 
var aString:String = "Hello"



