/*:
 ## 複数選択
 
 人生には選択がつきものです。多くの場合はいくつかのオプションから1つを選ぶ必要があり、何も選ばないというのは選択ではありません。
 */
/*: 
 例えば、ある日の学校のカフェテリアでは、パスタ、ハンバーガー、またはスープというランチの選択肢が用意されているかもしれません。複数の料理を組み合わせることは許されそうにないので、1つを選ばなければなりません。
 */
/*: 
 1つを選びます。 
 */
/*:
 このシステムはカフェテリアと学校に適しています。

 - 店員は、3つの料理のうち1つを提供すればよいことがわかっています。
     
    
 - 店員はすばやく効率的にそれぞれの料理を準備して提供できます。
 
 
 - 特別な注文を受けたりそれを理解したりするのに時間を費やすことがありません。
 
 
 - 学校は、全員が栄養のある昼食を取って午後の学習に備えていることがわかります。
 */
/*:
 プログラマであるあなたは、このような同じ種類の管理された選択肢をプログラムに適用することによってメリットを得られます。 
 */
/*:
1／21ページ  |  [次は「判断する、ふたたび」です。](@next)
*/
